// *++
//
// Copyright (c) 2004 - 2009, Intel Corporation
// All rights reserved. This program and the accompanying materials
// are licensed and made available under the terms and conditions of the BSD License
// which accompanies this distribution.  The full text of the license may be found at
// http://opensource.org/licenses/bsd-license.php
//
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.
//
// Module Name:
//
//   strings.uni
//
// Abstract:
//
//   String definitions.
//
// --*/


// vim:fenc=ucs-2le 
/=#
#langdef en-US "English"

#string STR_MULTIBOOT_TITLE                    #language en-US  "Multiboot title!!!"

#string STR_MULTIBOOT_HELP                     #language en-US  ""

#string STR_MULTIBOOT_MAIN_PAGE_TITLE          #language en-US  "Multiboot loader"

#string STR_MULTIBOOT_MAIN_PAGE_HELP           #language en-US  "↑ and ↓ to change option, ENTER to select an option ESC to exit."

#string STR_MULTIBOOT_ENTRY_EDIT_TITLE         #language en-US  "Edit OS entry options"

#string STR_MULTIBOOT_MODULE_EDIT_TITLE        #language en-US  "Edit OS module options"

#string STR_MULTIBOOT_OPTION_DESC              #language en-US  ""

#string STR_TEST_BOOT_OPTION                   #language en-US  "Test Boot Option"

#string STR_MULTIBOOT_NULL_STRING              #language en-US  ""

#string STR_MULTIBOOT_EDIT_ENTRY_DESC          #language en-US  "Edit entry name"

#string STR_CONFIG_ERROR                       #language en-US  "Load config file error."

#string STR_DEFAULT_NOT_FOUND                  #language en-US  "Default boot entry not  found."

#string STR_WAIT_TITLE                         #language en-US "Press Enter to start, Esc to change option select."

#string STR_WAIT_STARTUP_TIMEOUT               #language en-US "Start [%s] after %d sec.    "

#string STR_START_BOOTING                      #language en-US "Booting [%s] ..."

#string STR_HASH_ERROR                         #language en-US "Wrong signature hash."

#string STR_HASH_NOT_PRESENT                   #language en-US "Signature hash not present"

#string STR_BIOS_HASH_CHECK                    #language en-US "Bios signature hash check..."

#string STR_FILE_HASH_CHECK                    #language en-US "File signature hash check..."

#string STR_SUCCESS                            #language en-US "Success"

#string STR_ERROR                              #language en-US "Error"

#string STR_LOADING_FILE                       #language en-US "Loading file [%a] ..."



